[
  {
    "product_id": "0001",
    "title": "Baby Spinach Omelet",
    "effort": "15 minutes",
    "description": "Enjoy this spinach omelet with tender baby greens, Parmesan cheese, and a little nutmeg cooked together for the perfect start to the day.",
    "ingredients": "2 eggs\n\n1 cup torn baby spinach leaves\n\n1 ½ tablespoons grated Parmesan cheese\n\n¼ teaspoon onion powder\n\n⅛ teaspoon ground nutmeg\n\nsalt and pepper to taste",
    "steps": "Beat eggs in a bowl, and stir in baby spinach and Parmesan cheese. Season with onion powder, nutmeg, salt, and pepper.\n\nSpray a small skillet with cooking spray and place over medium heat. Once warm, add in the egg mixture and cook until partially set, about 3 minutes. Flip with a spatula, and continue cooking, 2 to 3 minutes.\n\nReduce heat to low and continue cooking, 2 to 3 minutes, or until omelet reaches desired doneness.",
    "image_file_url": ""
  },
  {
    "product_id": "0002",
    "title": "Creamy Garlic Pasta",
    "effort": "30 minutes",
    "description": "As far as creamy pasta recipes, this is the best I have ever had. Add prawns and/or scallops to make an amazing seafood Alfredo.",
    "ingredients": "2 teaspoons olive oil\n\n4 garlic cloves, minced\n\n2 tablespoons butter\n\n3 cups chicken broth, or more as needed\n\n½ teaspoon ground black pepper\n\n¼ teaspoon salt\n\n½ pound spaghetti\n\n1 cup grated Parmesan cheese\n\n¾ cup heavy cream\n\n1 ½ tablespoons dried parsley",
    "steps": "Heat olive oil in a medium pan over medium heat. Add garlic and stir until fragrant, 1 to 2 minutes. Add butter and stir constantly until melted. Pour in 3 cups chicken broth; add pepper and salt. Bring to a boil.\n\nAdd spaghetti and cook, stirring occasionally, until tender yet firm to the bite, about 12 minutes. Add more chicken broth if pasta starts to stick to the pan.\n\nAdd Parmesan cheese, cream, and parsley and mix until thoroughly combined. Serve immediately.",
    "image_file_url": ""
  },
  {
    "product_id": "0003",
    "title": "Pork Fried Rice",
    "effort": "30 minutes",
    "description": "A flavourful recipe with rice and vegetables.",
    "ingredients": "1 tablespoon butter\n\n1 (6 ounce) boneless pork loin chop, cut into small pieces\n\n1 green onion, chopped\n\n¼ cup chopped carrot\n\n¼ cup chopped broccoli\n\n1 egg, beaten\n\n1 cup cold cooked rice\n\n¼ cup frozen peas\n\n1 ½ tablespoons soy sauce\n\n⅛ teaspoon garlic powder\n\n⅛ teaspoon ground ginger",
    "steps": "Melt butter in a large non-stick skillet over medium heat. Add pork, green onion, carrot, and broccoli; cook and stir until pork is cooked through, 7 to 10 minutes. Transfer pork mixture to a bowl and return skillet to medium heat.\n\nStir egg into the skillet and scramble until completely set. Add pork mixture back into the skillet; stir in rice, peas, soy sauce, garlic powder, and ground ginger. Cook and stir until heated through, 7 to 10 minutes.",
    "image_file_url": ""
  },
  {
    "product_id": "0004",
    "title": "Cheesy Ramen Noodles",
    "effort": "5 minutes",
    "description": "Melting cheese in ramen makes for an extremely simple and delicious spin on typical ramen noodles that can be easily made in the college environment.",
    "ingredients": "2 cups water\n\n1 (3 ounce) package any flavor ramen noodles\n\n1 slice American cheese",
    "steps": "Bring water to a boil in a saucepan. Add ramen noodles and cook until tender, about 2 minutes. Pour out water, then stir in seasoning packet and cheese until well blended.",
    "image_file_url": ""
  },
  {
    "product_id": "0005",
    "title": "Stuffed Peppers",
    "effort": "1 hour 20 minutes",
    "description": "As a highly customizable recipe, stuffed peppers are always a great fit.",
    "ingredients": "1/2 c. uncooked rice\n2 tbsp. extra-virgin olive oil, plus more for drizzling\n1 medium onion, chopped\n2 tbsp. tomato paste\n3 cloves garlic, minced\n1 lb. ground beef\n1 (14.5-oz.) can diced tomatoes\n1 1/2 tsp. dried oregano\nKosher salt\nFreshly ground black pepper\n6 bell peppers, tops and cores removed\n1 c. shredded Monterey jack\nFreshly chopped parsley, for garnish",
    "steps": "Preheat oven to 400°. In a small saucepan, prepare rice according to package instructions. In a large skillet over medium heat, heat oil. Cook onion until soft, about 5 minutes. Stir in tomato paste and garlic and cook until fragrant, about 1 minute more. Add ground beef and cook, breaking up meat with a wooden spoon, until no longer pink, 6 minutes. Drain fat.\nStep 2\nReturn beef mixture to skillet, then stir in cooked rice and diced tomatoes. Season with oregano, salt, and pepper. Let simmer until liquid has reduced slightly, about 5 minutes.\nStep 3\nPlace peppers cut side-up in a 9\"-x-13\" baking dish and drizzle with oil. Spoon beef mixture into each pepper and top with Monterey jack, then cover baking dish with foil.\nStep 4\nBake until peppers are tender, about 35 minutes. Uncover and bake until cheese is bubbly, 10 minutes more.\nStep 5\nGarnish with parsley before serving.",
    "image_file_url": ""
  },
  {
    "product_id": "0006",
    "title": "Baked Spaghetti",
    "effort": "1 hour",
    "description": "This casserole is what comfort food is all about — cheesy, hearty, and completely versatile to whatever you have on hand. Ready in around an hour, this is the simplest and most satisfying dish when you're looking to truly please, without heaps of extra effort. ",
    "ingredients": "16 oz. spaghetti\n2 tbsp. extra-virgin olive oil\n1 medium yellow onion, finely chopped\n2 cloves garlic, minced\n1 lb. ground beef\nkosher salt\nFreshly ground black pepper\n1 tsp. Italian seasoning\n1 (28-oz.) can crushed tomatoes\n1/2 c. basil, chopped\n1 c. shredded mozzarella\n1/4 c. freshly grated Parmesan\nChopped fresh parsley, for garnish",
    "steps": "Step 1\nPreheat oven to 350°. Grease a medium baking dish with cooking spray. Cook spaghetti according to package directions until al dente, drain, and set aside.\nStep 2\nMeanwhile, in a large skillet over medium heat, heat oil. Add onions and cook until soft and translucent, about 5 minutes. Stir in garlic and cook until fragrant, 1 minute more. Add ground beef, season with salt, pepper, and Italian seasoning, and cook until no longer pink, about 8 minutes. Drain fat in a bowl lined with paper towels and return to pan. Pour in crushed tomatoes and basil and simmer until slightly reduced, about 10 minutes. Season with more salt and pepper to taste.\nStep 3\nToss with spaghetti, then transfer to baking dish and top with mozzarella and Parmesan. Bake until cheese is melted and pasta is warmed through, about 20 minutes.\nStep 4\nGarnish with parsley and serve.",
    "image_file_url": ""
  },
  {
    "product_id": "0007",
    "title": "Carbonara Pasta",
    "effort": "25 minutes",
    "description": "Have dinner on the table in 15 minutes with this deliciously easy carbonara pasta!",
    "ingredients": "375g spaghetti\n\n1 tbsp olive oil\n\n200g shortcut bacon rashers, cut into 2cm-long pieces\n\n2 eggs\n\n2 egg yolks\n\n1/2 cup pure cream\n\n2/3 cup finely grated parmesan cheese\n\nFresh flat-leaf parsley leaves, to serve",
    "steps": "Step 1\nCook pasta in a large saucepan of boiling salted water, following packet directions until tender. Drain. Return to pan.\nStep 2\nMeanwhile, heat oil in a frying pan over medium-high heat. Add bacon. Cook for 4 minutes or until crisp.\nStep 3\nWhisk eggs, egg yolks, cream and parmesan in a jug. Season with pepper.\nStep 4\nAdd bacon and egg mixture to pasta. Cook, tossing, over low heat for 1 minute or until combined. Top with parsley. Serve.",
    "image_file_url": ""
  },
  {
    "product_id": "0008",
    "title": "Creamy Salmon Risoni",
    "effort": "20 minutes",
    "description": "Creamy, but made with no cream! Salmon risoni is brilliant for weeknight meals because it cooks so quickly and can be made in one pot.",
    "ingredients": "40g butter\n\n1/2 brown onion, diced\n\n2 garlic cloves, crushed\n\n1 tbsp plain flour\n\n2 cups milk\n\n1 1/2 cups dried risoni\n\n2 1/4 cups Massel chicken style liquid stock\n\n2 cups frozen peas\n\n1/2 cup grated parmesan\n\n185g hot-smoked salmon, flaked into large pieces (see note)\n\nChopped fresh flat-leaf parsley, to serve\n\nSalad leaves, to serve",
    "steps": "Step 1\nMelt butter in a large, heavy-based saucepan over medium-high heat. Add onion and garlic. Cook, stirring, for 2 minutes. Add flour. Cook, stirring, for 30 seconds. Whisk in 1/2 the milk until combined. Whisk in remaining milk.\nStep 2\nAdd risoni, stock and peas. Stir to combine. Increase heat to high. Bring to a simmer. Reduce heat to medium. Cook for 5 minutes, stirring occasionally, until the risoni is just cooked (there will be quite a bit of liquid in the pan at this stage). Remove from heat.\nStep 3\nStir in parmesan, then the salmon. Season with salt and pepper. Sprinkle with parsley. Serve with salad leaves.",
    "image_file_url": ""
  },
  {
    "product_id": "0009",
    "title": "Fast, Easy Chicken Marsala",
    "effort": "30 minutes",
    "description": "If you're looking for ways to make chicken a little less boring, put this recipe in your pocket. The classic creamy, savory sauce is easy to make and so good you'll want to drizzle it over everything.",
    "ingredients": "1/2 c. all-purpose flour\n8 chicken cutlets or 4 chicken breasts, sliced in half (about 1.5 lbs)\nKosher salt and freshly ground black pepper\n2 tbsp. canola oil\n2 tbsp. unsalted butter\n1 (8-ounce) package sliced mushrooms\n1/3 c. chopped onion (about 1/2 small onion)\n2 cloves garlic, chopped\n1/2 c. dry Marsala wine\n3/4 c. chicken stock\n1/2 c. heavy cream\n1 tsp. fresh thyme, plus more for garnish",
    "steps": "Step 1\nPlace flour in a shallow bowl. Use a meat tenderizer or the bottom of a sturdy cup to pound chicken to about 1/4 inch thick. Season with salt and pepper. Dredge chicken in flour, turning to coat all sides. Heat oil in a medium skillet over medium-high heat. Cook chicken in batches, turning once, until golden brown, 3 to 4 minutes. Transfer to a plate and tent to keep warm. Reserve skillet.\nStep 2\nPour off oil from skillet. Melt butter in skillet over medium heat. Add mushroom and onions. Season with salt and pepper. Cook, stirring occasionally, until tender, 5 to 7 minutes. Add garlic and cook, stirring, until fragrant, 2 to 3 minutes. Add wine, stock, cream, and thyme. Simmer, stirring occasionally, until thickened, 14 to 16 minutes. Season with salt and pepper. Return chicken to pan and toss to coat. Serve immediately garnished with  thyme.",
    "image_file_url": ""
  },
  {
    "product_id": "0010",
    "title": "Crispy Gnocchi with Sausage and Butter",
    "effort": "30 minutes",
    "description": "Keep this four-ingredient dish in your back pocket for whenever you want a simple, filling meal in a flash.",
    "ingredients": "10 tbsp. (1 1/4 sticks) unsalted butter, divided\n2 tbsp. chopped fresh sage\n12 oz. sweet Italian sausage, casings removed\n2 (9-ounce) packages store-bought gnocchi",
    "steps": "Step 1\nMelt 8 tablespoons butter in a small saucepan over medium-low heat. Cook, swirling occasionally, until golden brown and nutty smelling, 8 to 10 minutes. Add sage and cook, until crisp, 5 to 10 seconds. \nStep 2\nMelt remaining 2 tablespoons butter in a medium skillet over medium-high heat. Add sausage and cook, breaking it up with a spoon, until browned and cooked through, 10 to 12 minutes. Transfer to a plate. \nStep 3\nPour off all but 2 tablespoons fat from skillet; reduce heat to medium. Add gnocchi and spread into a single layer. Cook, without stirring, 2 minutes. Toss, and continue cooking, until golden brown and crispy, 3 to 4 minutes. Add sage butter and sausage, and cook until warmed through, 1 to 2 minutes.",
    "image_file_url": ""
  }
]

